import c from "./RulesPage.module.scss";

interface RulesPageProps {}

function RulesPage({}: RulesPageProps) {
	return (
		<div className={c.rulesPage}>
			<div className="container">
				<h1 className={c.title}>Правила сайта</h1>
				<span className={c.subtitle}>
					<strong>Основные положения и трактовка правил.</strong>
				</span>
				<ul className={c.list}>
					<li>
						Сайт создан для того, чтобы читателям было удобно читать, а
						контентмейкерам (переводчикам и авторам) — переводить проекты. Любые
						действия, совершённые для дестабилизации ситуаций, мешающие работе
						сайта и переводчиков - запрещены.
					</li>
					<li>
						Ни одни правила не идеальны. Потому мы очень негативно настроены к
						попыткам ложной интерпретации и абьюза правил. Если у вас есть
						вопросы по правилам, напишите нам! Ситуации, не описанные в правилах
						сайта, решаются по усмотрению старших модераторов сайта в
						соответствии с законодательством РФ.
					</li>
					<li>
						Все решения выносят администраторы и модераторы сайта в соответствии
						с правилами сайта, законодательством РФ и, в нестандартных и
						чрезвычайных ситуациях. Если какого-то правила нет или оно
						несовершенно, трактовка правил ложится на плечи модераторов и
						администраторов сайта.
					</li>
				</ul>
			</div>
		</div>
	);
}

export default RulesPage;
